; domain
(define (domain industrial_manufacturing)
    (:requirements :strips :typing)
    (:types
        location box content agent workstation content-type carrier place - object
    )

    (:predicates
        (connected ?loc1 ?loc2 - location)
        (box-at-loc ?box - box ?loc - location)
        (agent-at-loc ?agent - agent ?loc - location)
        (ws-at-loc ?ws - workstation ?loc - location)
        (content-at-loc ?content - content ?loc - location)
        (is-type ?content - content ?t - content-type)
        (empty-box ?box - box)
        (filled-box ?box - box ?content - content)
        (box-at-ws ?box - box ?ws - workstation)
        (box-at-place ?box - box ?place - place)
        (content-type-at-ws ?t - content-type ?ws - workstation)
        (empty-place ?place - place)
        (place-at-carrier ?place - place ?carrier - carrier)
        (carrier-at-agent ?carrier - carrier ?agent - agent)
    )

    (:action pick-up
        :parameters (?loc - location ?box - box ?agent - agent ?carrier - carrier ?place - place)
        :precondition (and
            (agent-at-loc ?agent ?loc)
            (box-at-loc ?box ?loc)
            (carrier-at-agent ?carrier ?agent)
            (place-at-carrier ?place ?carrier)
            (empty-place ?place)
        )
        :effect (and
            (box-at-place ?box ?place)
            (not (empty-place ?place))
            (not (box-at-loc ?box ?loc))
        )
    )

    (:action move
        :parameters (?from ?to - location ?agent - agent)
        :precondition (and
            (connected ?from ?to)
            (agent-at-loc ?agent ?from)
        )
        :effect (and
            (not (agent-at-loc ?agent ?from))
            (agent-at-loc ?agent ?to)
        )
    )

    (:action deliver
        :parameters (?box - box ?content - content ?t - content-type ?ws - workstation ?location - location ?agent - agent ?carrier - carrier ?place - place)
        :precondition (and
            (is-type ?content ?t)
            (ws-at-loc ?ws ?location)
            (agent-at-loc ?agent ?location)
            (carrier-at-agent ?carrier ?agent)
            (place-at-carrier ?place ?carrier)
            (box-at-place ?box ?place)
            (filled-box ?box ?content)
        )
        :effect (and
            (not (box-at-place ?box ?place))
            (empty-place ?place)
            (box-at-ws ?box ?ws)
        )
    )

    (:action fill
        :parameters (?box - box ?content - content ?t - content-type ?loc - location ?agent - agent ?carrier - carrier ?place - place)
        :precondition (and
            (is-type ?content ?t)
            (content-at-loc ?content ?loc)
            (agent-at-loc ?agent ?loc)
            (carrier-at-agent ?carrier ?agent)
            (place-at-carrier ?place ?carrier)
            (box-at-place ?box ?place)
            (empty-box ?box)
        )
        :effect (and
            (not (empty-box ?box))
            (filled-box ?box ?content)
            (not (content-at-loc ?content ?loc))
        )
    )

    (:action empty
        :parameters (?box - box ?content - content ?t - content-type ?ws - workstation ?agent - agent ?loc - location)
        :precondition (and
            (is-type ?content ?t)
            (box-at-ws ?box ?ws)
            (ws-at-loc ?ws ?loc)
            (filled-box ?box ?content)
            (agent-at-loc ?agent ?loc)
        )
        :effect (and
            (not (filled-box ?box ?content))
            (empty-box ?box)
            (box-at-loc ?box ?loc)
            (not (box-at-ws ?box ?ws))
            (content-type-at-ws ?t ?ws)
        )
    )
)

; problem
(define (problem p03)
    (:domain industrial_manufacturing)
    (:objects
        central_warehouse loc1 loc2 - location
        ws1 ws2 ws3 ws4 - workstation
        b1 b2 b3 - box
        a1 a2 - agent
        c1 c2 - carrier
        p11 p12 p21 - place
        valve1 valve2 bolt1 bolt2 bolt3 bolt4 tool1 tool2 hammer1 hammer2 - content
        valve bolt tool hammer - content-type
    )
    (:init
        (connected central_warehouse loc1)
        (connected central_warehouse loc2)
        (connected loc1 central_warehouse)
        (connected loc2 central_warehouse)

        (box-at-loc b1 central_warehouse)
        (box-at-loc b2 central_warehouse)
        (box-at-loc b3 central_warehouse)
        (empty-box b1)
        (empty-box b2)
        (empty-box b3)
        
        (is-type valve1 valve)
        (is-type valve2 valve)
        (is-type bolt1 bolt)
        (is-type bolt2 bolt)
        (is-type bolt3 bolt)
        (is-type bolt4 bolt)
        (is-type tool1 tool)
        (is-type tool2 tool)
        (is-type hammer1 hammer)
        (is-type hammer2 hammer)

        (content-at-loc valve1 central_warehouse)
        (content-at-loc valve2 central_warehouse)
        (content-at-loc bolt1 central_warehouse)
        (content-at-loc bolt2 central_warehouse)
        (content-at-loc bolt3 central_warehouse)
        (content-at-loc bolt4 central_warehouse)
        (content-at-loc tool1 central_warehouse)
        (content-at-loc tool2 central_warehouse)
        (content-at-loc hammer1 central_warehouse)
        (content-at-loc hammer2 central_warehouse)

        (ws-at-loc ws1 loc1)
        (ws-at-loc ws2 loc1)
        (ws-at-loc ws3 loc2)
        (ws-at-loc ws4 loc2)

        (agent-at-loc a1 central_warehouse)
        (carrier-at-agent c1 a1)
        (place-at-carrier p11 c1)
        (place-at-carrier p12 c1)
        (agent-at-loc a2 central_warehouse)
        (carrier-at-agent c2 a2)
        (place-at-carrier p21 c2)

        (empty-place p11)
        (empty-place p12)
        (empty-place p21)
    )
    (:goal
        (and
            (content-type-at-ws bolt ws1)
            (content-type-at-ws tool ws1)
            (content-type-at-ws hammer ws1)

            (content-type-at-ws valve ws2)
            (content-type-at-ws hammer ws2)
            (content-type-at-ws bolt ws2)
            (content-type-at-ws tool ws2)

            (content-type-at-ws valve ws3)
            (content-type-at-ws bolt ws3)

            (content-type-at-ws bolt ws4)
        )
    )
)

; plan
1. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 0 of 10
2. (pick-up central_warehouse b3 a2 c2 p21)
   deleted: (empty-place p21) (box-at-loc b3 central_warehouse)
   added: (box-at-place b3 p21)
   goals met: 0 of 10
3. (fill b3 hammer1 hammer central_warehouse a2 c2 p21)
   deleted: (empty-box b3) (content-at-loc hammer1 central_warehouse)
   added: (filled-box b3 hammer1)
   goals met: 0 of 10
4. (move central_warehouse loc1 a2)
   deleted: (agent-at-loc a2 central_warehouse)
   added: (agent-at-loc a2 loc1)
   goals met: 0 of 10
5. (deliver b3 hammer1 hammer ws1 loc1 a2 c2 p21)
   deleted: (box-at-place b3 p21)
   added: (empty-place p21) (box-at-ws b3 ws1)
   goals met: 0 of 10
6. (empty b3 hammer1 hammer ws1 a1 loc1)
   deleted: (filled-box b3 hammer1) (box-at-ws b3 ws1)
   added: (empty-box b3) (box-at-loc b3 loc1) (content-type-at-ws hammer ws1)
   goals met: 1 of 10
7. (pick-up loc1 b3 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b3 loc1)
   added: (box-at-place b3 p11)
   goals met: 1 of 10
8. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 1 of 10
9. (fill b3 valve1 valve central_warehouse a1 c1 p11)
   deleted: (empty-box b3) (content-at-loc valve1 central_warehouse)
   added: (filled-box b3 valve1)
   goals met: 1 of 10
10. (move central_warehouse loc2 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc2)
   goals met: 1 of 10
11. (deliver b3 valve1 valve ws3 loc2 a1 c1 p11)
   deleted: (box-at-place b3 p11)
   added: (empty-place p11) (box-at-ws b3 ws3)
   goals met: 1 of 10
12. (empty b3 valve1 valve ws3 a1 loc2)
   deleted: (filled-box b3 valve1) (box-at-ws b3 ws3)
   added: (empty-box b3) (box-at-loc b3 loc2) (content-type-at-ws valve ws3)
   goals met: 2 of 10
13. (pick-up loc2 b3 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b3 loc2)
   added: (box-at-place b3 p11)
   goals met: 2 of 10
14. (move loc2 central_warehouse a1)
   deleted: (agent-at-loc a1 loc2)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 2 of 10
15. (fill b3 bolt1 bolt central_warehouse a1 c1 p11)
   deleted: (empty-box b3) (content-at-loc bolt1 central_warehouse)
   added: (filled-box b3 bolt1)
   goals met: 2 of 10
16. (move central_warehouse loc2 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc2)
   goals met: 2 of 10
17. (deliver b3 bolt1 bolt ws3 loc2 a1 c1 p11)
   deleted: (box-at-place b3 p11)
   added: (empty-place p11) (box-at-ws b3 ws3)
   goals met: 2 of 10
18. (empty b3 bolt1 bolt ws3 a1 loc2)
   deleted: (filled-box b3 bolt1) (box-at-ws b3 ws3)
   added: (empty-box b3) (box-at-loc b3 loc2) (content-type-at-ws bolt ws3)
   goals met: 3 of 10
19. (pick-up loc2 b3 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b3 loc2)
   added: (box-at-place b3 p11)
   goals met: 3 of 10
20. (move loc2 central_warehouse a1)
   deleted: (agent-at-loc a1 loc2)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 3 of 10
21. (fill b3 bolt2 bolt central_warehouse a1 c1 p11)
   deleted: (empty-box b3) (content-at-loc bolt2 central_warehouse)
   added: (filled-box b3 bolt2)
   goals met: 3 of 10
22. (move central_warehouse loc2 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc2)
   goals met: 3 of 10
23. (deliver b3 bolt2 bolt ws4 loc2 a1 c1 p11)
   deleted: (box-at-place b3 p11)
   added: (empty-place p11) (box-at-ws b3 ws4)
   goals met: 3 of 10
24. (empty b3 bolt2 bolt ws4 a1 loc2)
   deleted: (filled-box b3 bolt2) (box-at-ws b3 ws4)
   added: (empty-box b3) (box-at-loc b3 loc2) (content-type-at-ws bolt ws4)
   goals met: 4 of 10
25. (move loc2 central_warehouse a1)
   deleted: (agent-at-loc a1 loc2)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 4 of 10
26. (pick-up central_warehouse b2 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b2 central_warehouse)
   added: (box-at-place b2 p11)
   goals met: 4 of 10
27. (fill b2 valve2 valve central_warehouse a1 c1 p11)
   deleted: (empty-box b2) (content-at-loc valve2 central_warehouse)
   added: (filled-box b2 valve2)
   goals met: 4 of 10
28. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 4 of 10
29. (deliver b2 valve2 valve ws2 loc1 a1 c1 p11)
   deleted: (box-at-place b2 p11)
   added: (empty-place p11) (box-at-ws b2 ws2)
   goals met: 4 of 10
30. (empty b2 valve2 valve ws2 a1 loc1)
   deleted: (filled-box b2 valve2) (box-at-ws b2 ws2)
   added: (empty-box b2) (box-at-loc b2 loc1) (content-type-at-ws valve ws2)
   goals met: 5 of 10
31. (pick-up loc1 b2 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b2 loc1)
   added: (box-at-place b2 p11)
   goals met: 5 of 10
32. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 5 of 10
33. (fill b2 hammer2 hammer central_warehouse a1 c1 p11)
   deleted: (empty-box b2) (content-at-loc hammer2 central_warehouse)
   added: (filled-box b2 hammer2)
   goals met: 5 of 10
34. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 5 of 10
35. (deliver b2 hammer2 hammer ws2 loc1 a1 c1 p11)
   deleted: (box-at-place b2 p11)
   added: (empty-place p11) (box-at-ws b2 ws2)
   goals met: 5 of 10
36. (empty b2 hammer2 hammer ws2 a1 loc1)
   deleted: (filled-box b2 hammer2) (box-at-ws b2 ws2)
   added: (empty-box b2) (box-at-loc b2 loc1) (content-type-at-ws hammer ws2)
   goals met: 6 of 10
37. (pick-up loc1 b2 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b2 loc1)
   added: (box-at-place b2 p11)
   goals met: 6 of 10
38. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 6 of 10
39. (fill b2 bolt3 bolt central_warehouse a1 c1 p11)
   deleted: (empty-box b2) (content-at-loc bolt3 central_warehouse)
   added: (filled-box b2 bolt3)
   goals met: 6 of 10
40. (pick-up central_warehouse b1 a1 c1 p12)
   deleted: (empty-place p12) (box-at-loc b1 central_warehouse)
   added: (box-at-place b1 p12)
   goals met: 6 of 10
41. (fill b1 bolt4 bolt central_warehouse a1 c1 p12)
   deleted: (empty-box b1) (content-at-loc bolt4 central_warehouse)
   added: (filled-box b1 bolt4)
   goals met: 6 of 10
42. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 6 of 10
43. (deliver b2 bolt3 bolt ws1 loc1 a1 c1 p11)
   deleted: (box-at-place b2 p11)
   added: (empty-place p11) (box-at-ws b2 ws1)
   goals met: 6 of 10
44. (empty b2 bolt3 bolt ws1 a1 loc1)
   deleted: (filled-box b2 bolt3) (box-at-ws b2 ws1)
   added: (empty-box b2) (box-at-loc b2 loc1) (content-type-at-ws bolt ws1)
   goals met: 7 of 10
45. (deliver b1 bolt4 bolt ws2 loc1 a1 c1 p12)
   deleted: (box-at-place b1 p12)
   added: (empty-place p12) (box-at-ws b1 ws2)
   goals met: 7 of 10
46. (pick-up loc1 b2 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b2 loc1)
   added: (box-at-place b2 p11)
   goals met: 7 of 10
47. (empty b1 bolt4 bolt ws2 a1 loc1)
   deleted: (filled-box b1 bolt4) (box-at-ws b1 ws2)
   added: (empty-box b1) (box-at-loc b1 loc1) (content-type-at-ws bolt ws2)
   goals met: 8 of 10
48. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 8 of 10
49. (fill b2 tool1 tool central_warehouse a1 c1 p11)
   deleted: (empty-box b2) (content-at-loc tool1 central_warehouse)
   added: (filled-box b2 tool1)
   goals met: 8 of 10
50. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 8 of 10
51. (deliver b2 tool1 tool ws1 loc1 a1 c1 p11)
   deleted: (box-at-place b2 p11)
   added: (empty-place p11) (box-at-ws b2 ws1)
   goals met: 8 of 10
52. (empty b2 tool1 tool ws1 a1 loc1)
   deleted: (filled-box b2 tool1) (box-at-ws b2 ws1)
   added: (empty-box b2) (box-at-loc b2 loc1) (content-type-at-ws tool ws1)
   goals met: 9 of 10
53. (pick-up loc1 b2 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b2 loc1)
   added: (box-at-place b2 p11)
   goals met: 9 of 10
54. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 9 of 10
55. (fill b2 tool2 tool central_warehouse a1 c1 p11)
   deleted: (empty-box b2) (content-at-loc tool2 central_warehouse)
   added: (filled-box b2 tool2)
   goals met: 9 of 10
56. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 9 of 10
57. (deliver b2 tool2 tool ws2 loc1 a1 c1 p11)
   deleted: (box-at-place b2 p11)
   added: (empty-place p11) (box-at-ws b2 ws2)
   goals met: 9 of 10
58. (empty b2 tool2 tool ws2 a1 loc1)
   deleted: (filled-box b2 tool2) (box-at-ws b2 ws2)
   added: (empty-box b2) (box-at-loc b2 loc1) (content-type-at-ws tool ws2)
   goals met: 10 of 10
